zymelkajakub/program/stm32f4_ssd1963_fsmc.c
  /* Configure the FSMC Parallel interface */
  LCD_FSMCConfig();
	
  delay(50000); 
	
  /* Reset LCD */
  GPIO_ResetBits(LCD_RST_PORT, LCD_RST_PIN);	
  delay(200000);	
  GPIO_SetBits(LCD_RST_PORT, LCD_RST_PIN);

  /* Write 16-bit Index, then Write Reg */
//  LCD_CMD = LCD_Reg;
  /* Write 16-bit Reg */
//  LCD_Data = LCD_RegValue;
	
  /*
  SSD1963Init(void)
  */
	/* Software reset */
	LCD_CMD = SSD1963_SOFT_RESET;

	LCD_CMD = SSD1963_SET_PLL_MN;
	LCD_Data= 0x1D;	// PLLclk = REFclk * 30 (300MHz)
	LCD_Data= 0x02;	// SYSclk = PLLclk / 3  (100MHz)
	LCD_Data= 0x04;  // dummy

	LCD_WriteReg(SSD1963_SET_PLL, 0x01);
  _delay_(100);

	LCD_WriteReg(SSD1963_SET_PLL, 0x03);

	LCD_CMD = SSD1963_SET_LCD_MODE; 
	LCD_Data= 0x0C;			
	LCD_Data= 0x00;			
	LCD_Data= mHIGH((TFT_WIDTH-1));
	LCD_Data= mLOW((TFT_WIDTH-1));
	LCD_Data= mHIGH((TFT_HEIGHT-1));
	LCD_Data= mLOW((TFT_HEIGHT-1));
	LCD_Data= 0x00;

	LCD_WriteReg(SSD1963_SET_PIXEL_DATA_INTERFACE, SSD1963_PDI_16BIT565);

	LCD_CMD = SSD1963_SET_LSHIFT_FREQ; 
	LCD_Data= /*(LCD_FPR >> 16) & 0x07*/ 0x04;  //00
	LCD_Data= /*(LCD_FPR >> 8 ) & 0xFF*/ 0x00; //77
	LCD_Data= /*LCD_FPR & 0xFF*/ 0x00;         //BB

	LCD_CMD = SSD1963_SET_HORI_PERIOD;
	LCD_Data= mHIGH(TFT_HSYNC_PERIOD);
	LCD_Data= mLOW(TFT_HSYNC_PERIOD);
	LCD_Data= mHIGH((TFT_HSYNC_PULSE + TFT_HSYNC_BACK_PORCH));
	LCD_Data= mLOW((TFT_HSYNC_PULSE + TFT_HSYNC_BACK_PORCH));
	LCD_Data= TFT_HSYNC_PULSE;
	LCD_Data= 0x00;			
	LCD_Data= 0x00;
	LCD_Data= 0x00;			

	LCD_CMD = SSD1963_SET_VERT_PERIOD; 		
	LCD_Data= mHIGH(TFT_VSYNC_PERIOD);
	LCD_Data= mLOW(TFT_VSYNC_PERIOD);
	LCD_Data= mHIGH((TFT_VSYNC_PULSE + TFT_VSYNC_BACK_PORCH));
	LCD_Data= mLOW((TFT_VSYNC_PULSE + TFT_VSYNC_BACK_PORCH));
	LCD_Data= TFT_VSYNC_PULSE;
	LCD_Data= 0x00;			
	LCD_Data= 0x00;

	//SSD1963_WriteCommand(SSD1963_SET_TEAR_ON);			// SET TE signal Output ON
	//SSD1963_WriteData(0x00);
	//SSD1963_WriteData(0x00);
	LCD_CMD = SSD1963_SET_DISPLAY_ON;		//SET display on
}


//=============================================================================
// Function:  void  SetBacklight(BYTE intensity)
//
// Overview: This function makes use of PWM feature of ssd1963 to adjust
//                        the backlight intensity.
//
// PreCondition: Backlight circuit with shutdown pin connected to PWM output of ssd1963.
//
// Input:         (BYTE) intensity from
//                        0x00 (total backlight shutdown, PWM pin pull-down to VSS)
//                        0xff (99% pull-up, 255/256 pull-up to VDD)
//
// Output: none
//
// Note: The base frequency of PWM set to around 300Hz with PLL set to 120MHz.
//                This parameter is hardware dependent
//
//=============================================================================

void SetBacklight(uint8_t intensity)
{
        LCD_CMD = 0xBE;                        // Set PWM configuration for backlight control
//        SSD1963_PIN_CS = 0;
        LCD_Data= 0x0E;                        // PWMF[7:0] = 2, PWM base freq = PLL/(256*(1+5))/256 =
                                                                // 300Hz for a PLL freq = 120MHz
        LCD_Data= intensity;                // Set duty cycle, from 0x00 (total pull-down) to 0xFF
                                                                // (99% pull-up , 255/256)
        LCD_Data= 0x01;                        // PWM enabled and controlled by host (mcu)
        LCD_Data= 0x00;

//        CS_LAT_BIT = 1;
}

/**
  * @brief  Writes to the selected LCD register.
  * @param  LCD_Reg: address of the selected register.
  * @param  LCD_RegValue: value to write to the selected register.
  * @retval None
  */
void LCD_WriteReg(uint8_t LCD_Reg, uint16_t LCD_RegValue)
{
  /* Write 16-bit Index, then Write Reg */
  LCD_CMD = LCD_Reg;
  /* Write 16-bit Reg */
  LCD_Data = LCD_RegValue;
}

/**
  * @brief  Reads the selected LCD Register.
  * @param  LCD_Reg: address of the selected register.
  * @retval LCD Register Value.
  */
uint16_t LCD_ReadReg(uint8_t LCD_Reg)
{
  /* Write 16-bit Index (then Read Reg) */
  LCD_CMD = LCD_Reg;
  /* Read 16-bit Reg */
  return (LCD_Data);
}

/**
  * @brief  Prepare to write to the LCD RAM.
  * @param  None
  * @retval None
  */
void LCD_WriteRAM_Prepare(void)
{
	LCD_CMD = SSD1963_WRITE_MEMORY_START;
}

/**
  * @brief  Writes to the LCD RAM.
  * @param  RGB_Code: the pixel color in RGB mode (5-6-5).
  * @retval None
  */
void LCD_WriteRAM(uint16_t RGB_Code)
{
  /* Write 16-bit GRAM Reg */
  LCD_Data = RGB_Code;
}

/**
  * @brief  Reads the LCD RAM.
  * @param  None
  * @retval LCD RAM Value.
  */
uint16_t LCD_ReadRAM(void)
{
  /* Write 16-bit Index (then Read Reg) */
//  LCD_CMD = SSD2119_RAM_DATA_REG; /* Select GRAM Reg */
  /* Read 16-bit Reg */
  return LCD_Data;
}

/**
  * @brief  Test LCD Display
  * @retval None
  */
void LCD_RGB_Test(void)
{
  uint32_t index;

	SSD1963_SetArea(0, TFT_WIDTH-1 , 0, TFT_HEIGHT-1);
  LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */

	/* R */
  for(index = 0; index < (LCD_PIXEL_HEIGHT*LCD_PIXEL_WIDTH)/3; index++)
  {
    LCD_Data = LCD_COLOR_RED;
  }
	  
  /* G */
  for(;index < 2*(LCD_PIXEL_HEIGHT*LCD_PIXEL_WIDTH)/3; index++)
  {
    LCD_Data = LCD_COLOR_GREEN;
  }
	  
	/* B */
  for(; index < LCD_PIXEL_HEIGHT*LCD_PIXEL_WIDTH; index++)
  {
    LCD_Data = LCD_COLOR_BLUE;
  }
}

//=============================================================================
//
//=============================================================================
void SSD1963_SetArea(uint16_t sx, uint16_t ex, uint16_t sy, uint16_t ey)
{
	LCD_CMD = SSD1963_SET_COLUMN_ADDRESS;        
  LCD_Data = ((sx >> 8) & 0xFF);
  LCD_Data = ((sx >> 0) & 0xFF);
  LCD_Data = ((ex >> 8) & 0xFF);
  LCD_Data = ((ex >> 0) & 0xFF);

	LCD_CMD = SSD1963_SET_PAGE_ADDRESS;        
  LCD_Data = ((sy >> 8) & 0xFF);
  LCD_Data = ((sy >> 0) & 0xFF);
  LCD_Data = ((ey >> 8) & 0xFF);
  LCD_Data = ((ey >> 0) & 0xFF);
}

