zymelkajakub/program/stm32f4_ssd1963_fsmc.c
//=============================================================================
// Fill area of specified color
//=============================================================================
void SSD1963_FillArea(uint16_t sx, uint16_t ex, uint16_t sy, uint16_t ey, uint16_t color)
{
	uint16_t i;
	SSD1963_SetArea(sx, ex, sy, ey);
	LCD_CMD = SSD1963_WRITE_MEMORY_START;
	for(i = 0; i < ((ex-sx+1)*(ey-sy+1)); i++)
        {
        LCD_Data = (color);
        }
}

//=============================================================================
// Fills whole screen specified color
//=============================================================================
void LCD_Clear(uint16_t color)
{
	uint16_t x,y;
//	TE = GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_10);
//	while (TE==0) {TE = GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_10);}
	SSD1963_SetArea(0, TFT_WIDTH-1 , 0, TFT_HEIGHT-1);
	LCD_CMD = SSD1963_WRITE_MEMORY_START;
	for(x=0;x<TFT_WIDTH;x++)
	{
		for(y= 0;y<TFT_HEIGHT;y++)
		{
			LCD_Data = (color);
		}
	}

}
//=============================================================================
//
//=============================================================================
void SSD1963_SetPixel(uint16_t x, uint16_t y, uint16_t color)
{
	SSD1963_SetArea(x, x, y, y);
	LCD_CMD = SSD1963_WRITE_MEMORY_START;
	LCD_Data = (color);
	//LCD_CMD = 0x0;
}


/*void SSD1963_bitmap(void)
{
uint16_t a, b;
SSD1963_SetArea(0, TFT_WIDTH-1 , 0, TFT_HEIGHT-1);
SSD1963_WriteCommand(0x2c);
for(a=0;a<TFT_WIDTH;a++)
        {
        for(b=0;b<TFT_HEIGHT;b++)
                {
                SSD1963_WriteData(tapeta[(b+(480*a))]);
                }
        }
}*/

/**
  * @brief  Sets the LCD Text and Background colors.
  * @param  _TextColor: specifies the Text Color.
  * @param  _BackColor: specifies the Background Color.
  * @retval None
  */
void LCD_SetColors(__IO uint16_t _TextColor, __IO uint16_t _BackColor)
{
  TextColor = _TextColor; 
  BackColor = _BackColor;
}

/**
  * @brief  Gets the LCD Text and Background colors.
  * @param  _TextColor: pointer to the variable that will contain the Text 
            Color.
  * @param  _BackColor: pointer to the variable that will contain the Background 
            Color.
  * @retval None
  */
void LCD_GetColors(__IO uint16_t *_TextColor, __IO uint16_t *_BackColor)
{
  *_TextColor = TextColor; *_BackColor = BackColor;
}

/**
  * @brief  Sets the Text color.
  * @param  Color: specifies the Text color code RGB(5-6-5).
  * @retval None
  */
void LCD_SetTextColor(__IO uint16_t Color)
{
  TextColor = Color;
}


/**
  * @brief  Sets the Background color.
  * @param  Color: specifies the Background color code RGB(5-6-5).
  * @retval None
  */
void LCD_SetBackColor(__IO uint16_t Color)
{
  BackColor = Color;
}

void LCD_SetFont(sFONT *fonts)
{
  LCD_Currentfonts = fonts;
}

/**
  * @brief  Gets the Text Font.
  * @param  None.
  * @retval the used font.
  */
sFONT *LCD_GetFont(void)
{
  return LCD_Currentfonts;
}


/**
  * @brief  Draws a character on LCD.
  * @param  Xpos: the Line where to display the character shape.
  * @param  Ypos: start column address.
  * @param  c: pointer to the character data.
  * @retval None
  */
void LCD_pisz_znak(uint16_t Xpos, uint16_t Ypos, uint16_t ascii)
{
  uint32_t index = 0, i = 0, j=1;
	uint8_t character = ascii - 0x20;
	SSD1963_SetArea(Xpos, Xpos+(tekst[character][0])-1, Ypos, Ypos+23);
	LCD_CMD = SSD1963_WRITE_MEMORY_START;
  for(index = 0; index < tekst[character][0]; index++)
  {
    for(i = 0; i < 24; i++)
    {
			LCD_Data = (tekst[character][j]);
			j++;
    }
  }
}

void LCD_pisz_tekst(uint16_t Column, uint16_t Line, uint8_t *ptr)
{
  /* Send the string character by character on lCD */
  while ((*ptr != 0) & (((Column + 1) & 0xFFFF) <= TFT_WIDTH))
  {
    /* Display one character on LCD */
    LCD_pisz_znak(Column, Line, *ptr);
    /* Decrement the column position by 16 */
    Column += (tekst[(*ptr)-0x20][0]);
    /* Point on the next character */
    ptr++;
  }
}


/**
  * @brief  Draws a character on LCD.
  * @param  Xpos: the Line where to display the character shape.
  * @param  Ypos: start column address.
  * @param  c: pointer to the character data.
  * @retval None
  */
void LCD_DrawChar(uint16_t Xpos, uint16_t Ypos, const uint16_t *c)
{
  uint32_t index = 0, i = 0;
  
  for(index = 0; index < LCD_Currentfonts->Height; index++)
  {
    for(i = 0; i < LCD_Currentfonts->Width; i++)
    {
  
      if((((c[index] & ((0x80 << ((LCD_Currentfonts->Width / 12 ) * 8 ) ) >> i)) == 0x00) &&(LCD_Currentfonts->Width <= 12))||
        (((c[index] & (0x1 << i)) == 0x00)&&(LCD_Currentfonts->Width > 12 )))

      {
        SSD1963_SetPixel(Ypos+i, Xpos+index, BackColor);
      }
      else
      {
        SSD1963_SetPixel(Ypos+i, Xpos+index, TextColor);
      } 
    }
  }
}

/**
  * @brief  Displays one character (16dots width, 24dots height).
  * @param  Line: the Line where to display the character shape .
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..9
  * @param  Column: start column address.
  * @param  Ascii: character ascii code, must be between 0x20 and 0x7E.
  * @retval None
  */
void LCD_DisplayChar(uint16_t Line, uint16_t Column, uint8_t Ascii)
{
  Ascii -= 32;
  LCD_DrawChar(Line, Column, &LCD_Currentfonts->table[Ascii * LCD_Currentfonts->Height]);
}

/**
  * @brief  Clears the selected line.
  * @param  Line: the Line to be cleared.
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..n
  * @retval None
  */
void LCD_ClearLine(uint16_t Line)
{
  uint16_t refcolumn = TFT_WIDTH - 1;
  /* Send the string character by character on lCD */
  while (((refcolumn + 1)& 0xFFFF) >= LCD_Currentfonts->Width)
  {
    /* Display one character on LCD */
    LCD_DisplayChar(Line, refcolumn, ' ');
    /* Decrement the column position by 16 */
    refcolumn -= LCD_Currentfonts->Width;
  }
}

/**
  * @brief  Displays a maximum of 20 char on the LCD.
  * @param  Line: the Line where to display the character shape .
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..9
  * @param  *ptr: pointer to string to display on LCD.
  * @retval None
  */
void LCD_DisplayStringLine(uint16_t Line, uint16_t Column, uint8_t *ptr)
{
  uint16_t refcolumn = Column + 1;

  /* Send the string character by character on lCD */
  while ((*ptr != 0) & (((refcolumn + 1) & 0xFFFF) <= TFT_WIDTH))
  {
    /* Display one character on LCD */
    LCD_DisplayChar(Line, refcolumn, *ptr);
    /* Decrement the column position by 16 */
    refcolumn += LCD_Currentfonts->Width;
    /* Point on the next character */
    ptr++;
  }
}

/**
  * @brief  Displays a line.
  * @param Xpos: specifies the X position.
  * @param Ypos: specifies the Y position.
  * @param Length: line length.
  * @param Direction: line direction.
  *   This parameter can be one of the following values: Vertical or Horizontal.
  * @retval None
  */
void LCD_DrawLine(uint16_t Xpos, uint16_t Ypos, uint16_t Length, uint8_t Direction)
{
  uint32_t i = 0;
  
  if(Direction == LCD_DIR_HORIZONTAL)
  {
    for(i = 0; i < Length; i++)
    {
      SSD1963_SetPixel(Xpos, Ypos+i, TextColor);
    }
  }
  else
  {
    for(i = 0; i < Length; i++)
    {
      SSD1963_SetPixel(Xpos+i, Ypos, TextColor);
    }
  }
}

/**
  * @brief  Displays a rectangle.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @param  Height: display rectangle height.
  * @param  Width: display rectangle width.
  * @retval None
  */
void LCD_DrawRect(uint16_t Xpos, uint16_t Ypos, uint8_t Height, uint16_t Width)
{
  LCD_DrawLine(Xpos, Ypos, Width, LCD_DIR_HORIZONTAL);
  LCD_DrawLine((Xpos + Height), Ypos, Width, LCD_DIR_HORIZONTAL);
  
  LCD_DrawLine(Xpos, Ypos, Height, LCD_DIR_VERTICAL);
  LCD_DrawLine(Xpos, (Ypos - Width + 1), Height, LCD_DIR_VERTICAL);
}

/**
  * @brief  Displays a circle.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @param  Radius
  * @retval None
  */
void LCD_DrawCircle(uint16_t Xpos, uint16_t Ypos, uint16_t Radius)
{
  int32_t  D;/* Decision Variable */ 
  uint32_t  CurX;/* Current X Value */
  uint32_t  CurY;/* Current Y Value */ 
  
  D = 3 - (Radius << 1);
  CurX = 0;
  CurY = Radius;
  
  while (CurX <= CurY)
  {
    SSD1963_SetPixel(Xpos + CurX, Ypos + CurY, TextColor);
    SSD1963_SetPixel(Xpos + CurX, Ypos - CurY, TextColor);
    SSD1963_SetPixel(Xpos - CurX, Ypos + CurY, TextColor);
    SSD1963_SetPixel(Xpos - CurX, Ypos - CurY, TextColor);
    SSD1963_SetPixel(Xpos + CurY, Ypos + CurX, TextColor);
    SSD1963_SetPixel(Xpos + CurY, Ypos - CurX, TextColor);
    SSD1963_SetPixel(Xpos - CurY, Ypos + CurX, TextColor);
    SSD1963_SetPixel(Xpos - CurY, Ypos - CurX, TextColor);
    if (D < 0)
    { 
      D += (CurX << 2) + 6;
    }
    else
    {
      D += ((CurX - CurY) << 2) + 10;
      CurY--;
    }
    CurX++;
  }
}

/**
  * @brief  Displays a full rectangle.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @param  Height: rectangle height.
  * @param  Width: rectangle width.
  * @retval None
  */
void LCD_DrawFullRect(uint16_t Xpos, uint16_t Ypos, uint16_t Width, uint16_t Height)
{
  LCD_SetTextColor(TextColor);

